Terraform plan for __staging__
<details>
<summary>Plan: 1 to add, 2 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # cloudfoundry_user_provided_service.ssb-solrcloud-k8s will be updated in-place
  ~ resource "cloudfoundry_user_provided_service" "ssb-solrcloud-k8s" {
      ~ credentials_json = (sensitive value)
        id               = "f9f9f40d-912e-4b30-99c4-2704dc39081c"
        name             = "ssb-solrcloud-k8s"
        tags             = []
        # (1 unchanged attribute hidden)
    }

  # module.broker_solr.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "8e3cb315-a469-4906-814f-1832906c912f"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-solr"
      ~ source_code_hash           = "XiYr3BX9sxZDqxn59BFZ5FCtHcIdmnlBOjcJlB6gz+I=" -> "mWPaBLocbys5qgLeyQe4LRbIRTWzASRsfXI/OFtIRa4="
        # (18 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }

  # module.brokerpak-eks-terraform.module.bind.data.aws_eks_cluster.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "main"  {
      ~ arn                       = "arn:aws:eks:us-west-2:054110281448:cluster/k8s-d6e0b7fc580c3a4d" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXdNekUyTkRnek1Gb1hEVE15TURJeU9URTJORGd6TUZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTmNDCmRXWldQWGsrR0NPYkFEWlFObTZJTG4veHpuVGhnKzR1SUhCUjd3c213NUErRExIQlFlNi96Qjhqck9hNXFHdUIKMlNiS3FTaXRBT1ZTOTdxNEdLWXZKekV2bG1uVks2Lzg0ZWx4eXJjL2FFZWxjdmZLZE84NGtwTGNPeE9lWUpEYwpRVTZwZlFxN2FoejhLRkxvSnQvR3NlUi9VYzl0NjdkczZsNUVqTkZuam1IMEZ3bjZNaWxCcjlUWXZiSmsrYmF3CkwzeXErSjU1K1kyNnc5TXFzci9uOHFJQ0YyaUp5Y2lMMWJDOG5CUnp4NmVMOWhqekc1VzBpQVcvaHV5OVUxR3gKTGRxMytMU3pBNXRtekhRekpHekg3bUdVaEdJWi9xQkpwc3orRUhSeFdWVmhJWGVpSWNnWExKcmgzNWxaOFlDaApkSnVxb1ZlbmRONC96NzFZR0lFQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZDdHB5TzErZ3VPNTc3TGl3ODBiR20xdkt6Q2RNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBaWNKV1ZqaDBxd1dFRWdsK2gvMm1BNzdUWFdEN0ltc3dHWE9PNUcwMGErcGtJU0R2bgpPbGpQQ2dxb3dpYmFQaTZrZjB0ZlFmTzc2UUp5eWJxV01Bai96bSs3Z3l4RGVSVGFkVGRablNRRG9sbDBDRnZmCkl5WlZESzJWZThXclUrVGJFT3lCSWk0ejFYV1JkeWx1M3R0WDZENXdBWFo1di84Z0ZWV3kzbDhzQ3BINmhYUk8KTUZlbUlvR0dXUFROYXg0a3BWcGFROHE4M1VFNGxMcnlWTGFGTEhjZStkQzlOS1dTc2xMVnRwa205TmFxVHpiNApZcHJZYklmWnUrRm1TS2ZyYU5xanFDUlJxb045c2VEeG53TUMvbFVReTQ4SG9ZSFhoRjhxUXdVaFZnN0M2dFoyCmVXZkFQcVFaUG1mWEZvb2V4akRRUHpHNG1BWVFBS1p6RXFvYgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2022-03-03 16:42:30.494 +0000 UTC" -> (known after apply)
      ~ enabled_cluster_log_types = [
          - "api",
          - "audit",
          - "authenticator",
          - "controllerManager",
          - "scheduler",
        ] -> (known after apply)
      ~ endpoint                  = "https://E97035E8E3B7536C8E5BAEA9123ECC97.gr7.us-west-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "********************" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-west-2.amazonaws.com/id/E97035E8E3B7536C8E5BAEA9123ECC97"
                    },
                ]
            },
        ] -> (known after apply)
      ~ kubernetes_network_config = [
          - {
              - ip_family         = "ipv4"
              - service_ipv4_cidr = "172.20.0.0/16"
            },
        ] -> (known after apply)
        name                      = "k8s-d6e0b7fc580c3a4d"
      ~ platform_version          = "eks.4" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::054110281448:role/k8s-d6e0b7fc580c3a4d-cluster-20220303163904249300000004" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      ~ tags                      = {
          - "domain" = "solrcloud-k8s.ssb-staging.data.gov"
        } -> (known after apply)
      ~ version                   = "1.21" -> (known after apply)
      ~ vpc_config                = [
          - {
              - cluster_security_group_id = "********************"
              - endpoint_private_access   = false
              - endpoint_public_access    = true
              - public_access_cidrs       = [
                  - "0.0.0.0/0",
                ]
              - security_group_ids        = [
                  - "sg-033458e536cdfbf6e",
                ]
              - subnet_ids                = [
                  - "subnet-095181b79768c6bb2",
                  - "subnet-0ae384f0e2f4fdf5a",
                  - "subnet-0fb9117ab72a85725",
                ]
              - vpc_id                    = "*********************"
            },
        ] -> (known after apply)
    }

  # module.brokerpak-eks-terraform.module.bind.data.aws_eks_cluster_auth.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "main"  {
      ~ id    = "********************" -> (known after apply)
        name  = "k8s-d6e0b7fc580c3a4d"
      ~ token = (sensitive value)
    }

  # module.brokerpak-eks-terraform.module.bind.data.kubernetes_secret.secret will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_secret" "secret"  {
      ~ data      = (sensitive value)
      ~ id        = "************************************" -> (known after apply)
      ~ immutable = false -> (known after apply)
      ~ type      = "kubernetes.io/service-account-token" -> (known after apply)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "a4b24fc558d22fbd-token-hzcjg"
          ~ resource_version = "6289" -> (known after apply)
          ~ uid              = "ee489a7d-243a-42ed-a905-5891c4439a51" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.brokerpak-eks-terraform.module.bind.data.template_file.kubeconfig will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "kubeconfig"  {
      ~ id       = "****************************************************************" -> (known after apply)
      ~ rendered = <<-EOT
            apiVersion: v1
            kind: Config
            users:
            - name: a4b24fc558d22fbd
              user:
                token: eyJhbGciOiJSUzI1NiIsImtpZCI6IlZ4NXZ4N1l2UWduclh5VFJwdU84VnBac0hCUGFSbzNrTVNFTk9WOTFhbmcifQ.eyJpc3MiOiJrdWJlcm5ldGVzL3NlcnZpY2VhY2NvdW50Iiwia3ViZXJuZXRlcy5pby9zZXJ2aWNlYWNjb3VudC9uYW1lc3BhY2UiOiJkZWZhdWx0Iiwia3ViZXJuZXRlcy5pby9zZXJ2aWNlYWNjb3VudC9zZWNyZXQubmFtZSI6ImE0YjI0ZmM1NThkMjJmYmQtdG9rZW4taHpjamciLCJrdWJlcm5ldGVzLmlvL3NlcnZpY2VhY2NvdW50L3NlcnZpY2UtYWNjb3VudC5uYW1lIjoiYTRiMjRmYzU1OGQyMmZiZCIsImt1YmVybmV0ZXMuaW8vc2VydmljZWFjY291bnQvc2VydmljZS1hY2NvdW50LnVpZCI6IjAyZGQxOWI5LTg3MGYtNGZkMy04OTNlLWU4OGQyOWZiMjZmMyIsInN1YiI6InN5c3RlbTpzZXJ2aWNlYWNjb3VudDpkZWZhdWx0OmE0YjI0ZmM1NThkMjJmYmQifQ.gWoKBJW2I1vV2cpFNjnPQCz2XTueM6Tsk3mgEEBOfYVqfB6ZxqNmuyNinUuaH6piEntL4KwkL1Gn_X8bSZvO_8VLSIFAo9uNBxtEwz7oB3MDPbTaJWjMM4Ed-zHWHRHiHZDsvZ-nWUWICj6NcrI-Uy3_cB7nA9IJZV2nsWL3HnNFGTQEP2UDaCItMcqQcTGADVgGlZ5eZSsxm00aSxT-VlnFfkQ-2hpzos0yi0rAbwaVZxUXuIHVOWmFnIBKy_DkADUxet_RiZFRq9rCbtlfgXJNgrR_jXc-dTsd7y3d8grTpscdh9FGKBCUk0g6vWvmgnStZ0aGqJGOfB8uMJ2CxA
            clusters:
            - cluster:
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXdNekUyTkRnek1Gb1hEVE15TURJeU9URTJORGd6TUZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTmNDCmRXWldQWGsrR0NPYkFEWlFObTZJTG4veHpuVGhnKzR1SUhCUjd3c213NUErRExIQlFlNi96Qjhqck9hNXFHdUIKMlNiS3FTaXRBT1ZTOTdxNEdLWXZKekV2bG1uVks2Lzg0ZWx4eXJjL2FFZWxjdmZLZE84NGtwTGNPeE9lWUpEYwpRVTZwZlFxN2FoejhLRkxvSnQvR3NlUi9VYzl0NjdkczZsNUVqTkZuam1IMEZ3bjZNaWxCcjlUWXZiSmsrYmF3CkwzeXErSjU1K1kyNnc5TXFzci9uOHFJQ0YyaUp5Y2lMMWJDOG5CUnp4NmVMOWhqekc1VzBpQVcvaHV5OVUxR3gKTGRxMytMU3pBNXRtekhRekpHekg3bUdVaEdJWi9xQkpwc3orRUhSeFdWVmhJWGVpSWNnWExKcmgzNWxaOFlDaApkSnVxb1ZlbmRONC96NzFZR0lFQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZDdHB5TzErZ3VPNTc3TGl3ODBiR20xdkt6Q2RNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBaWNKV1ZqaDBxd1dFRWdsK2gvMm1BNzdUWFdEN0ltc3dHWE9PNUcwMGErcGtJU0R2bgpPbGpQQ2dxb3dpYmFQaTZrZjB0ZlFmTzc2UUp5eWJxV01Bai96bSs3Z3l4RGVSVGFkVGRablNRRG9sbDBDRnZmCkl5WlZESzJWZThXclUrVGJFT3lCSWk0ejFYV1JkeWx1M3R0WDZENXdBWFo1di84Z0ZWV3kzbDhzQ3BINmhYUk8KTUZlbUlvR0dXUFROYXg0a3BWcGFROHE4M1VFNGxMcnlWTGFGTEhjZStkQzlOS1dTc2xMVnRwa205TmFxVHpiNApZcHJZYklmWnUrRm1TS2ZyYU5xanFDUlJxb045c2VEeG53TUMvbFVReTQ4SG9ZSFhoRjhxUXdVaFZnN0M2dFoyCmVXZkFQcVFaUG1mWEZvb2V4akRRUHpHNG1BWVFBS1p6RXFvYgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
                server: https://E97035E8E3B7536C8E5BAEA9123ECC97.gr7.us-west-2.eks.amazonaws.com
              name: k8s-d6e0b7fc580c3a4d
            contexts:
            - context:
                cluster: k8s-d6e0b7fc580c3a4d
                namespace: default
                user: a4b24fc558d22fbd
              name: k8s-d6e0b7fc580c3a4d-default-a4b24fc558d22fbd
            current-context: k8s-d6e0b7fc580c3a4d-default-a4b24fc558d22fbd
        EOT -> (known after apply)
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ template = (sensitive) -> (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "kubeconfig-k8s-d6e0b7fc580c3a4d"
      + id                   = (known after apply)
      + sensitive_content    = (sensitive value)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [plan #201](https://github.com/GSA/datagov-ssb/actions/runs/1935323384)